package support

import java.text.Normalizer

class TestSet {
	static String allRegular = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789àèìòùáéíóú'

	static String allDelete = 'a̶b̶c̶d̶e̶f̶g̶h̶i̶j̶k̶l̶m̶n̶o̶p̶q̶r̶s̶t̶u̶v̶w̶x̶y̶z̶A̶B̶C̶D̶E̶F̶G̶H̶I̶J̶K̶L̶M̶N̶O̶P̶Q̶R̶S̶T̶U̶V̶W̶X̶Y̶Z̶0̶1̶2̶3̶4̶5̶6̶7̶8̶9̶à̶è̶ì̶ò̶ù̶á̶é̶í̶ó̶ú̶'

	static String allBold = '𝐚𝐛𝐜𝐝𝐞𝐟𝐠𝐡𝐢𝐣𝐤𝐥𝐦𝐧𝐨𝐩𝐪𝐫𝐬𝐭𝐮𝐯𝐰𝐱𝐲𝐳𝐀𝐁𝐂𝐃𝐄𝐅𝐆𝐇𝐈𝐉𝐊𝐋𝐌𝐍𝐎𝐏𝐐𝐑𝐒𝐓𝐔𝐕𝐖𝐗𝐘𝐙𝟎𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗𝐚̀𝐞̀𝐢̀𝐨̀𝐮̀𝐚́𝐞́𝐢́𝐨́𝐮́'

	static String allBoldDelete = '𝐚̶𝐛̶𝐜̶𝐝̶𝐞̶𝐟̶𝐠̶𝐡̶𝐢̶𝐣̶𝐤̶𝐥̶𝐦̶𝐧̶𝐨̶𝐩̶𝐪̶𝐫̶𝐬̶𝐭̶𝐮̶𝐯̶𝐰̶𝐱̶𝐲̶𝐳̶𝐀̶𝐁̶𝐂̶𝐃̶𝐄̶𝐅̶𝐆̶𝐇̶𝐈̶𝐉̶𝐊̶𝐋̶𝐌̶𝐍̶𝐎̶𝐏̶𝐐̶𝐑̶𝐒̶𝐓̶𝐔̶𝐕̶𝐖̶𝐗̶𝐘̶𝐙̶𝟎̶𝟏̶𝟐̶𝟑̶𝟒̶𝟓̶𝟔̶𝟕̶𝟖̶𝟗̶𝐚̶̀𝐞̶̀𝐢̶̀𝐨̶̀𝐮̶̀𝐚̶́𝐞̶́𝐢̶́𝐨̶́𝐮̶́'

	static String allItalic = '𝑎𝑏𝑐𝑑𝑒𝑓𝑔ℎ𝑖𝑗𝑘𝑙𝑚𝑛𝑜𝑝𝑞𝑟𝑠𝑡𝑢𝑣𝑤𝑥𝑦𝑧𝐴𝐵𝐶𝐷𝐸𝐹𝐺𝐻𝐼𝐽𝐾𝐿𝑀𝑁𝑂𝑃𝑄𝑅𝑆𝑇𝑈𝑉𝑊𝑋𝑌𝑍0123456789𝑎̀𝑒̀𝑖̀𝑜̀𝑢̀𝑎́𝑒́𝑖́𝑜́𝑢́'

	static String allItalicDelete = '𝑎̶𝑏̶𝑐̶𝑑̶𝑒̶𝑓̶𝑔̶ℎ̶𝑖̶𝑗̶𝑘̶𝑙̶𝑚̶𝑛̶𝑜̶𝑝̶𝑞̶𝑟̶𝑠̶𝑡̶𝑢̶𝑣̶𝑤̶𝑥̶𝑦̶𝑧̶𝐴̶𝐵̶𝐶̶𝐷̶𝐸̶𝐹̶𝐺̶𝐻̶𝐼̶𝐽̶𝐾̶𝐿̶𝑀̶𝑁̶𝑂̶𝑃̶𝑄̶𝑅̶𝑆̶𝑇̶𝑈̶𝑉̶𝑊̶𝑋̶𝑌̶𝑍̶0̶1̶2̶3̶4̶5̶6̶7̶8̶9̶𝑎̶̀𝑒̶̀𝑖̶̀𝑜̶̀𝑢̶̀𝑎̶́𝑒̶́𝑖̶́𝑜̶́𝑢̶́'

	static String allUnderline = 'a̲b̲c̲d̲e̲f̲g̲h̲i̲j̲k̲l̲m̲n̲o̲p̲q̲r̲s̲t̲u̲v̲w̲x̲y̲z̲A̲B̲C̲D̲E̲F̲G̲H̲I̲J̲K̲L̲M̲N̲O̲P̲Q̲R̲S̲T̲U̲V̲W̲X̲Y̲Z̲0̲1̲2̲3̲4̲5̲6̲7̲8̲9̲à̲è̲ì̲ò̲ù̲á̲é̲í̲ó̲ú̲'

	static String allUnderlineDelete = 'a̶̲b̶̲c̶̲d̶̲e̶̲f̶̲g̶̲h̶̲i̶̲j̶̲k̶̲l̶̲m̶̲n̶̲o̶̲p̶̲q̶̲r̶̲s̶̲t̶̲u̶̲v̶̲w̶̲x̶̲y̶̲z̶̲A̶̲B̶̲C̶̲D̶̲E̶̲F̶̲G̶̲H̶̲I̶̲J̶̲K̶̲L̶̲M̶̲N̶̲O̶̲P̶̲Q̶̲R̶̲S̶̲T̶̲U̶̲V̶̲W̶̲X̶̲Y̶̲Z̶̲0̶̲1̶̲2̶̲3̶̲4̶̲5̶̲6̶̲7̶̲8̶̲9̶̲à̶̲è̶̲ì̶̲ò̶̲ù̶̲á̶̲é̶̲í̶̲ó̶̲ú̶̲'

	static String allBoldItalic = '𝒂𝒃𝒄𝒅𝒆𝒇𝒈𝒉𝒊𝒋𝒌𝒍𝒎𝒏𝒐𝒑𝒒𝒓𝒔𝒕𝒖𝒗𝒘𝒙𝒚𝒛𝑨𝑩𝑪𝑫𝑬𝑭𝑮𝑯𝑰𝑱𝑲𝑳𝑴𝑵𝑶𝑷𝑸𝑹𝑺𝑻𝑼𝑽𝑾𝑿𝒀𝒁𝟎𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗𝒂̀𝒆̀𝒊̀𝒐̀𝒖̀𝒂́𝒆́𝒊́𝒐́𝒖́'

	static String allBoldItalicDelete = '𝒂̶𝒃̶𝒄̶𝒅̶𝒆̶𝒇̶𝒈̶𝒉̶𝒊̶𝒋̶𝒌̶𝒍̶𝒎̶𝒏̶𝒐̶𝒑̶𝒒̶𝒓̶𝒔̶𝒕̶𝒖̶𝒗̶𝒘̶𝒙̶𝒚̶𝒛̶𝑨̶𝑩̶𝑪̶𝑫̶𝑬̶𝑭̶𝑮̶𝑯̶𝑰̶𝑱̶𝑲̶𝑳̶𝑴̶𝑵̶𝑶̶𝑷̶𝑸̶𝑹̶𝑺̶𝑻̶𝑼̶𝑽̶𝑾̶𝑿̶𝒀̶𝒁̶𝟎̶𝟏̶𝟐̶𝟑̶𝟒̶𝟓̶𝟔̶𝟕̶𝟖̶𝟗̶𝒂̶̀𝒆̶̀𝒊̶̀𝒐̶̀𝒖̶̀𝒂̶́𝒆̶́𝒊̶́𝒐̶́𝒖̶́'

	static String allItalicUnderline = '𝑎̲𝑏̲𝑐̲𝑑̲𝑒̲𝑓̲𝑔̲ℎ̲𝑖̲𝑗̲𝑘̲𝑙̲𝑚̲𝑛̲𝑜̲𝑝̲𝑞̲𝑟̲𝑠̲𝑡̲𝑢̲𝑣̲𝑤̲𝑥̲𝑦̲𝑧̲𝐴̲𝐵̲𝐶̲𝐷̲𝐸̲𝐹̲𝐺̲𝐻̲𝐼̲𝐽̲𝐾̲𝐿̲𝑀̲𝑁̲𝑂̲𝑃̲𝑄̲𝑅̲𝑆̲𝑇̲𝑈̲𝑉̲𝑊̲𝑋̲𝑌̲𝑍̲0̲1̲2̲3̲4̲5̲6̲7̲8̲9̲𝑎̲̀𝑒̲̀𝑖̲̀𝑜̲̀𝑢̲̀𝑎̲́𝑒̲́𝑖̲́𝑜̲́𝑢̲́'

	static String allItalicUnderlineDelete = '𝑎̶̲𝑏̶̲𝑐̶̲𝑑̶̲𝑒̶̲𝑓̶̲𝑔̶̲ℎ̶̲𝑖̶̲𝑗̶̲𝑘̶̲𝑙̶̲𝑚̶̲𝑛̶̲𝑜̶̲𝑝̶̲𝑞̶̲𝑟̶̲𝑠̶̲𝑡̶̲𝑢̶̲𝑣̶̲𝑤̶̲𝑥̶̲𝑦̶̲𝑧̶̲𝐴̶̲𝐵̶̲𝐶̶̲𝐷̶̲𝐸̶̲𝐹̶̲𝐺̶̲𝐻̶̲𝐼̶̲𝐽̶̲𝐾̶̲𝐿̶̲𝑀̶̲𝑁̶̲𝑂̶̲𝑃̶̲𝑄̶̲𝑅̶̲𝑆̶̲𝑇̶̲𝑈̶̲𝑉̶̲𝑊̶̲𝑋̶̲𝑌̶̲𝑍̶̲0̶̲1̶̲2̶̲3̶̲4̶̲5̶̲6̶̲7̶̲8̶̲9̶̲𝑎̶̲̀𝑒̶̲̀𝑖̶̲̀𝑜̶̲̀𝑢̶̲̀𝑎̶̲́𝑒̶̲́𝑖̶̲́𝑜̶̲́𝑢̶̲́'

	static String allBoldUnderline = '𝐚̲𝐛̲𝐜̲𝐝̲𝐞̲𝐟̲𝐠̲𝐡̲𝐢̲𝐣̲𝐤̲𝐥̲𝐦̲𝐧̲𝐨̲𝐩̲𝐪̲𝐫̲𝐬̲𝐭̲𝐮̲𝐯̲𝐰̲𝐱̲𝐲̲𝐳̲𝐀̲𝐁̲𝐂̲𝐃̲𝐄̲𝐅̲𝐆̲𝐇̲𝐈̲𝐉̲𝐊̲𝐋̲𝐌̲𝐍̲𝐎̲𝐏̲𝐐̲𝐑̲𝐒̲𝐓̲𝐔̲𝐕̲𝐖̲𝐗̲𝐘̲𝐙̲𝟎̲𝟏̲𝟐̲𝟑̲𝟒̲𝟓̲𝟔̲𝟕̲𝟖̲𝟗̲𝐚̲̀𝐞̲̀𝐢̲̀𝐨̲̀𝐮̲̀𝐚̲́𝐞̲́𝐢̲́𝐨̲́𝐮̲́'

	static String allBoldUnderlineDelete = '𝐚̶̲𝐛̶̲𝐜̶̲𝐝̶̲𝐞̶̲𝐟̶̲𝐠̶̲𝐡̶̲𝐢̶̲𝐣̶̲𝐤̶̲𝐥̶̲𝐦̶̲𝐧̶̲𝐨̶̲𝐩̶̲𝐪̶̲𝐫̶̲𝐬̶̲𝐭̶̲𝐮̶̲𝐯̶̲𝐰̶̲𝐱̶̲𝐲̶̲𝐳̶̲𝐀̶̲𝐁̶̲𝐂̶̲𝐃̶̲𝐄̶̲𝐅̶̲𝐆̶̲𝐇̶̲𝐈̶̲𝐉̶̲𝐊̶̲𝐋̶̲𝐌̶̲𝐍̶̲𝐎̶̲𝐏̶̲𝐐̶̲𝐑̶̲𝐒̶̲𝐓̶̲𝐔̶̲𝐕̶̲𝐖̶̲𝐗̶̲𝐘̶̲𝐙̶̲𝟎̶̲𝟏̶̲𝟐̶̲𝟑̶̲𝟒̶̲𝟓̶̲𝟔̶̲𝟕̶̲𝟖̶̲𝟗̶̲𝐚̶̲̀𝐞̶̲̀𝐢̶̲̀𝐨̶̲̀𝐮̶̲̀𝐚̶̲́𝐞̶̲́𝐢̶̲́𝐨̶̲́𝐮̶̲́'

	static String allBoldItalicUnderline = '𝒂̲𝒃̲𝒄̲𝒅̲𝒆̲𝒇̲𝒈̲𝒉̲𝒊̲𝒋̲𝒌̲𝒍̲𝒎̲𝒏̲𝒐̲𝒑̲𝒒̲𝒓̲𝒔̲𝒕̲𝒖̲𝒗̲𝒘̲𝒙̲𝒚̲𝒛̲𝑨̲𝑩̲𝑪̲𝑫̲𝑬̲𝑭̲𝑮̲𝑯̲𝑰̲𝑱̲𝑲̲𝑳̲𝑴̲𝑵̲𝑶̲𝑷̲𝑸̲𝑹̲𝑺̲𝑻̲𝑼̲𝑽̲𝑾̲𝑿̲𝒀̲𝒁̲𝟎̲𝟏̲𝟐̲𝟑̲𝟒̲𝟓̲𝟔̲𝟕̲𝟖̲𝟗̲𝒂̲̀𝒆̲̀𝒊̲̀𝒐̲̀𝒖̲̀𝒂̲́𝒆̲́𝒊̲́𝒐̲́𝒖̲́'

	static String allBoldItalicUnderlineDelete = '𝒂̶̲𝒃̶̲𝒄̶̲𝒅̶̲𝒆̶̲𝒇̶̲𝒈̶̲𝒉̶̲𝒊̶̲𝒋̶̲𝒌̶̲𝒍̶̲𝒎̶̲𝒏̶̲𝒐̶̲𝒑̶̲𝒒̶̲𝒓̶̲𝒔̶̲𝒕̶̲𝒖̶̲𝒗̶̲𝒘̶̲𝒙̶̲𝒚̶̲𝒛̶̲𝑨̶̲𝑩̶̲𝑪̶̲𝑫̶̲𝑬̶̲𝑭̶̲𝑮̶̲𝑯̶̲𝑰̶̲𝑱̶̲𝑲̶̲𝑳̶̲𝑴̶̲𝑵̶̲𝑶̶̲𝑷̶̲𝑸̶̲𝑹̶̲𝑺̶̲𝑻̶̲𝑼̶̲𝑽̶̲𝑾̶̲𝑿̶̲𝒀̶̲𝒁̶̲𝟎̶̲𝟏̶̲𝟐̶̲𝟑̶̲𝟒̶̲𝟓̶̲𝟔̶̲𝟕̶̲𝟖̶̲𝟗̶̲𝒂̶̲̀𝒆̶̲̀𝒊̶̲̀𝒐̶̲̀𝒖̶̲̀𝒂̶̲́𝒆̶̲́𝒊̶̲́𝒐̶̲́𝒖̶̲́'

	// normalize order of the combining chars
	// (lowline, strokes and accents) 
	// to support string comparison in specifications
	static String normalizeCombiningChars(String input) {
		Normalizer.normalize(input, Normalizer.Form.NFD)
	}	

	static List toCodePoints(String input) {
		input.codePoints().collect()
	}
}
